littlekernel/lk/external/platform/TivaWare_C_Series-2.2.0.295/inc/tm4c129cnczad.h
//*****************************************************************************
//
// GPIO registers (PORTK)
//
//*****************************************************************************
#define GPIO_PORTK_DATA_BITS_R  ((volatile uint32_t *)0x40061000)
#define GPIO_PORTK_DATA_R       (*((volatile uint32_t *)0x400613FC))
#define GPIO_PORTK_DIR_R        (*((volatile uint32_t *)0x40061400))
#define GPIO_PORTK_IS_R         (*((volatile uint32_t *)0x40061404))
#define GPIO_PORTK_IBE_R        (*((volatile uint32_t *)0x40061408))
#define GPIO_PORTK_IEV_R        (*((volatile uint32_t *)0x4006140C))
#define GPIO_PORTK_IM_R         (*((volatile uint32_t *)0x40061410))
#define GPIO_PORTK_RIS_R        (*((volatile uint32_t *)0x40061414))
#define GPIO_PORTK_MIS_R        (*((volatile uint32_t *)0x40061418))
#define GPIO_PORTK_ICR_R        (*((volatile uint32_t *)0x4006141C))
#define GPIO_PORTK_AFSEL_R      (*((volatile uint32_t *)0x40061420))
#define GPIO_PORTK_DR2R_R       (*((volatile uint32_t *)0x40061500))
#define GPIO_PORTK_DR4R_R       (*((volatile uint32_t *)0x40061504))
#define GPIO_PORTK_DR8R_R       (*((volatile uint32_t *)0x40061508))
#define GPIO_PORTK_ODR_R        (*((volatile uint32_t *)0x4006150C))
#define GPIO_PORTK_PUR_R        (*((volatile uint32_t *)0x40061510))
#define GPIO_PORTK_PDR_R        (*((volatile uint32_t *)0x40061514))
#define GPIO_PORTK_SLR_R        (*((volatile uint32_t *)0x40061518))
#define GPIO_PORTK_DEN_R        (*((volatile uint32_t *)0x4006151C))
#define GPIO_PORTK_LOCK_R       (*((volatile uint32_t *)0x40061520))
#define GPIO_PORTK_CR_R         (*((volatile uint32_t *)0x40061524))
#define GPIO_PORTK_AMSEL_R      (*((volatile uint32_t *)0x40061528))
#define GPIO_PORTK_PCTL_R       (*((volatile uint32_t *)0x4006152C))
#define GPIO_PORTK_ADCCTL_R     (*((volatile uint32_t *)0x40061530))
#define GPIO_PORTK_DMACTL_R     (*((volatile uint32_t *)0x40061534))
#define GPIO_PORTK_SI_R         (*((volatile uint32_t *)0x40061538))
#define GPIO_PORTK_DR12R_R      (*((volatile uint32_t *)0x4006153C))
#define GPIO_PORTK_WAKEPEN_R    (*((volatile uint32_t *)0x40061540))
#define GPIO_PORTK_WAKELVL_R    (*((volatile uint32_t *)0x40061544))
#define GPIO_PORTK_WAKESTAT_R   (*((volatile uint32_t *)0x40061548))
#define GPIO_PORTK_PP_R         (*((volatile uint32_t *)0x40061FC0))
#define GPIO_PORTK_PC_R         (*((volatile uint32_t *)0x40061FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

//*****************************************************************************
//
// GPIO registers (PORTL)
//
//*****************************************************************************
#define GPIO_PORTL_DATA_BITS_R  ((volatile uint32_t *)0x40062000)
#define GPIO_PORTL_DATA_R       (*((volatile uint32_t *)0x400623FC))
#define GPIO_PORTL_DIR_R        (*((volatile uint32_t *)0x40062400))
#define GPIO_PORTL_IS_R         (*((volatile uint32_t *)0x40062404))
#define GPIO_PORTL_IBE_R        (*((volatile uint32_t *)0x40062408))
#define GPIO_PORTL_IEV_R        (*((volatile uint32_t *)0x4006240C))
#define GPIO_PORTL_IM_R         (*((volatile uint32_t *)0x40062410))
#define GPIO_PORTL_RIS_R        (*((volatile uint32_t *)0x40062414))
#define GPIO_PORTL_MIS_R        (*((volatile uint32_t *)0x40062418))
#define GPIO_PORTL_ICR_R        (*((volatile uint32_t *)0x4006241C))
#define GPIO_PORTL_AFSEL_R      (*((volatile uint32_t *)0x40062420))
#define GPIO_PORTL_DR2R_R       (*((volatile uint32_t *)0x40062500))
#define GPIO_PORTL_DR4R_R       (*((volatile uint32_t *)0x40062504))
#define GPIO_PORTL_DR8R_R       (*((volatile uint32_t *)0x40062508))
#define GPIO_PORTL_ODR_R        (*((volatile uint32_t *)0x4006250C))
#define GPIO_PORTL_PUR_R        (*((volatile uint32_t *)0x40062510))
#define GPIO_PORTL_PDR_R        (*((volatile uint32_t *)0x40062514))
#define GPIO_PORTL_SLR_R        (*((volatile uint32_t *)0x40062518))
#define GPIO_PORTL_DEN_R        (*((volatile uint32_t *)0x4006251C))
#define GPIO_PORTL_LOCK_R       (*((volatile uint32_t *)0x40062520))
#define GPIO_PORTL_CR_R         (*((volatile uint32_t *)0x40062524))
#define GPIO_PORTL_AMSEL_R      (*((volatile uint32_t *)0x40062528))
#define GPIO_PORTL_PCTL_R       (*((volatile uint32_t *)0x4006252C))
#define GPIO_PORTL_ADCCTL_R     (*((volatile uint32_t *)0x40062530))
#define GPIO_PORTL_DMACTL_R     (*((volatile uint32_t *)0x40062534))
#define GPIO_PORTL_SI_R         (*((volatile uint32_t *)0x40062538))
#define GPIO_PORTL_DR12R_R      (*((volatile uint32_t *)0x4006253C))
#define GPIO_PORTL_WAKEPEN_R    (*((volatile uint32_t *)0x40062540))
#define GPIO_PORTL_WAKELVL_R    (*((volatile uint32_t *)0x40062544))
#define GPIO_PORTL_WAKESTAT_R   (*((volatile uint32_t *)0x40062548))
#define GPIO_PORTL_PP_R         (*((volatile uint32_t *)0x40062FC0))
#define GPIO_PORTL_PC_R         (*((volatile uint32_t *)0x40062FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

//*****************************************************************************
//
// GPIO registers (PORTM)
//
//*****************************************************************************
#define GPIO_PORTM_DATA_BITS_R  ((volatile uint32_t *)0x40063000)
#define GPIO_PORTM_DATA_R       (*((volatile uint32_t *)0x400633FC))
#define GPIO_PORTM_DIR_R        (*((volatile uint32_t *)0x40063400))
#define GPIO_PORTM_IS_R         (*((volatile uint32_t *)0x40063404))
#define GPIO_PORTM_IBE_R        (*((volatile uint32_t *)0x40063408))
#define GPIO_PORTM_IEV_R        (*((volatile uint32_t *)0x4006340C))
#define GPIO_PORTM_IM_R         (*((volatile uint32_t *)0x40063410))
#define GPIO_PORTM_RIS_R        (*((volatile uint32_t *)0x40063414))
#define GPIO_PORTM_MIS_R        (*((volatile uint32_t *)0x40063418))
#define GPIO_PORTM_ICR_R        (*((volatile uint32_t *)0x4006341C))
#define GPIO_PORTM_AFSEL_R      (*((volatile uint32_t *)0x40063420))
#define GPIO_PORTM_DR2R_R       (*((volatile uint32_t *)0x40063500))
#define GPIO_PORTM_DR4R_R       (*((volatile uint32_t *)0x40063504))
#define GPIO_PORTM_DR8R_R       (*((volatile uint32_t *)0x40063508))
#define GPIO_PORTM_ODR_R        (*((volatile uint32_t *)0x4006350C))
#define GPIO_PORTM_PUR_R        (*((volatile uint32_t *)0x40063510))
#define GPIO_PORTM_PDR_R        (*((volatile uint32_t *)0x40063514))
#define GPIO_PORTM_SLR_R        (*((volatile uint32_t *)0x40063518))
#define GPIO_PORTM_DEN_R        (*((volatile uint32_t *)0x4006351C))
#define GPIO_PORTM_LOCK_R       (*((volatile uint32_t *)0x40063520))
#define GPIO_PORTM_CR_R         (*((volatile uint32_t *)0x40063524))
#define GPIO_PORTM_AMSEL_R      (*((volatile uint32_t *)0x40063528))
#define GPIO_PORTM_PCTL_R       (*((volatile uint32_t *)0x4006352C))
#define GPIO_PORTM_ADCCTL_R     (*((volatile uint32_t *)0x40063530))
#define GPIO_PORTM_DMACTL_R     (*((volatile uint32_t *)0x40063534))
#define GPIO_PORTM_SI_R         (*((volatile uint32_t *)0x40063538))
#define GPIO_PORTM_DR12R_R      (*((volatile uint32_t *)0x4006353C))
#define GPIO_PORTM_WAKEPEN_R    (*((volatile uint32_t *)0x40063540))
#define GPIO_PORTM_WAKELVL_R    (*((volatile uint32_t *)0x40063544))
#define GPIO_PORTM_WAKESTAT_R   (*((volatile uint32_t *)0x40063548))
#define GPIO_PORTM_PP_R         (*((volatile uint32_t *)0x40063FC0))
#define GPIO_PORTM_PC_R         (*((volatile uint32_t *)0x40063FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

//*****************************************************************************
//
// GPIO registers (PORTN)
//
//*****************************************************************************
#define GPIO_PORTN_DATA_BITS_R  ((volatile uint32_t *)0x40064000)
#define GPIO_PORTN_DATA_R       (*((volatile uint32_t *)0x400643FC))
#define GPIO_PORTN_DIR_R        (*((volatile uint32_t *)0x40064400))
#define GPIO_PORTN_IS_R         (*((volatile uint32_t *)0x40064404))
#define GPIO_PORTN_IBE_R        (*((volatile uint32_t *)0x40064408))
#define GPIO_PORTN_IEV_R        (*((volatile uint32_t *)0x4006440C))
#define GPIO_PORTN_IM_R         (*((volatile uint32_t *)0x40064410))
#define GPIO_PORTN_RIS_R        (*((volatile uint32_t *)0x40064414))
#define GPIO_PORTN_MIS_R        (*((volatile uint32_t *)0x40064418))
#define GPIO_PORTN_ICR_R        (*((volatile uint32_t *)0x4006441C))
#define GPIO_PORTN_AFSEL_R      (*((volatile uint32_t *)0x40064420))
#define GPIO_PORTN_DR2R_R       (*((volatile uint32_t *)0x40064500))
#define GPIO_PORTN_DR4R_R       (*((volatile uint32_t *)0x40064504))
#define GPIO_PORTN_DR8R_R       (*((volatile uint32_t *)0x40064508))
#define GPIO_PORTN_ODR_R        (*((volatile uint32_t *)0x4006450C))
#define GPIO_PORTN_PUR_R        (*((volatile uint32_t *)0x40064510))
#define GPIO_PORTN_PDR_R        (*((volatile uint32_t *)0x40064514))
#define GPIO_PORTN_SLR_R        (*((volatile uint32_t *)0x40064518))
#define GPIO_PORTN_DEN_R        (*((volatile uint32_t *)0x4006451C))
#define GPIO_PORTN_LOCK_R       (*((volatile uint32_t *)0x40064520))
#define GPIO_PORTN_CR_R         (*((volatile uint32_t *)0x40064524))
#define GPIO_PORTN_AMSEL_R      (*((volatile uint32_t *)0x40064528))
#define GPIO_PORTN_PCTL_R       (*((volatile uint32_t *)0x4006452C))
#define GPIO_PORTN_ADCCTL_R     (*((volatile uint32_t *)0x40064530))
#define GPIO_PORTN_DMACTL_R     (*((volatile uint32_t *)0x40064534))
#define GPIO_PORTN_SI_R         (*((volatile uint32_t *)0x40064538))
#define GPIO_PORTN_DR12R_R      (*((volatile uint32_t *)0x4006453C))
#define GPIO_PORTN_WAKEPEN_R    (*((volatile uint32_t *)0x40064540))
#define GPIO_PORTN_WAKELVL_R    (*((volatile uint32_t *)0x40064544))
#define GPIO_PORTN_WAKESTAT_R   (*((volatile uint32_t *)0x40064548))
#define GPIO_PORTN_PP_R         (*((volatile uint32_t *)0x40064FC0))
#define GPIO_PORTN_PC_R         (*((volatile uint32_t *)0x40064FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

//*****************************************************************************
//
// GPIO registers (PORTP)
//
//*****************************************************************************
#define GPIO_PORTP_DATA_BITS_R  ((volatile uint32_t *)0x40065000)
#define GPIO_PORTP_DATA_R       (*((volatile uint32_t *)0x400653FC))
#define GPIO_PORTP_DIR_R        (*((volatile uint32_t *)0x40065400))
#define GPIO_PORTP_IS_R         (*((volatile uint32_t *)0x40065404))
#define GPIO_PORTP_IBE_R        (*((volatile uint32_t *)0x40065408))
#define GPIO_PORTP_IEV_R        (*((volatile uint32_t *)0x4006540C))
#define GPIO_PORTP_IM_R         (*((volatile uint32_t *)0x40065410))
#define GPIO_PORTP_RIS_R        (*((volatile uint32_t *)0x40065414))
#define GPIO_PORTP_MIS_R        (*((volatile uint32_t *)0x40065418))
#define GPIO_PORTP_ICR_R        (*((volatile uint32_t *)0x4006541C))
#define GPIO_PORTP_AFSEL_R      (*((volatile uint32_t *)0x40065420))
#define GPIO_PORTP_DR2R_R       (*((volatile uint32_t *)0x40065500))
#define GPIO_PORTP_DR4R_R       (*((volatile uint32_t *)0x40065504))
#define GPIO_PORTP_DR8R_R       (*((volatile uint32_t *)0x40065508))
#define GPIO_PORTP_ODR_R        (*((volatile uint32_t *)0x4006550C))
#define GPIO_PORTP_PUR_R        (*((volatile uint32_t *)0x40065510))
#define GPIO_PORTP_PDR_R        (*((volatile uint32_t *)0x40065514))
#define GPIO_PORTP_SLR_R        (*((volatile uint32_t *)0x40065518))
#define GPIO_PORTP_DEN_R        (*((volatile uint32_t *)0x4006551C))
#define GPIO_PORTP_LOCK_R       (*((volatile uint32_t *)0x40065520))
#define GPIO_PORTP_CR_R         (*((volatile uint32_t *)0x40065524))
#define GPIO_PORTP_AMSEL_R      (*((volatile uint32_t *)0x40065528))
#define GPIO_PORTP_PCTL_R       (*((volatile uint32_t *)0x4006552C))
#define GPIO_PORTP_ADCCTL_R     (*((volatile uint32_t *)0x40065530))
#define GPIO_PORTP_DMACTL_R     (*((volatile uint32_t *)0x40065534))
#define GPIO_PORTP_SI_R         (*((volatile uint32_t *)0x40065538))
#define GPIO_PORTP_DR12R_R      (*((volatile uint32_t *)0x4006553C))
#define GPIO_PORTP_WAKEPEN_R    (*((volatile uint32_t *)0x40065540))
#define GPIO_PORTP_WAKELVL_R    (*((volatile uint32_t *)0x40065544))
#define GPIO_PORTP_WAKESTAT_R   (*((volatile uint32_t *)0x40065548))
#define GPIO_PORTP_PP_R         (*((volatile uint32_t *)0x40065FC0))
#define GPIO_PORTP_PC_R         (*((volatile uint32_t *)0x40065FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

//*****************************************************************************
//
// GPIO registers (PORTQ)
//
//*****************************************************************************
#define GPIO_PORTQ_DATA_BITS_R  ((volatile uint32_t *)0x40066000)
#define GPIO_PORTQ_DATA_R       (*((volatile uint32_t *)0x400663FC))
#define GPIO_PORTQ_DIR_R        (*((volatile uint32_t *)0x40066400))
#define GPIO_PORTQ_IS_R         (*((volatile uint32_t *)0x40066404))
#define GPIO_PORTQ_IBE_R        (*((volatile uint32_t *)0x40066408))
#define GPIO_PORTQ_IEV_R        (*((volatile uint32_t *)0x4006640C))
#define GPIO_PORTQ_IM_R         (*((volatile uint32_t *)0x40066410))
#define GPIO_PORTQ_RIS_R        (*((volatile uint32_t *)0x40066414))
#define GPIO_PORTQ_MIS_R        (*((volatile uint32_t *)0x40066418))
#define GPIO_PORTQ_ICR_R        (*((volatile uint32_t *)0x4006641C))
#define GPIO_PORTQ_AFSEL_R      (*((volatile uint32_t *)0x40066420))
#define GPIO_PORTQ_DR2R_R       (*((volatile uint32_t *)0x40066500))
#define GPIO_PORTQ_DR4R_R       (*((volatile uint32_t *)0x40066504))
#define GPIO_PORTQ_DR8R_R       (*((volatile uint32_t *)0x40066508))
#define GPIO_PORTQ_ODR_R        (*((volatile uint32_t *)0x4006650C))
#define GPIO_PORTQ_PUR_R        (*((volatile uint32_t *)0x40066510))
#define GPIO_PORTQ_PDR_R        (*((volatile uint32_t *)0x40066514))
#define GPIO_PORTQ_SLR_R        (*((volatile uint32_t *)0x40066518))
#define GPIO_PORTQ_DEN_R        (*((volatile uint32_t *)0x4006651C))
#define GPIO_PORTQ_LOCK_R       (*((volatile uint32_t *)0x40066520))
#define GPIO_PORTQ_CR_R         (*((volatile uint32_t *)0x40066524))
#define GPIO_PORTQ_AMSEL_R      (*((volatile uint32_t *)0x40066528))
#define GPIO_PORTQ_PCTL_R       (*((volatile uint32_t *)0x4006652C))
#define GPIO_PORTQ_ADCCTL_R     (*((volatile uint32_t *)0x40066530))
#define GPIO_PORTQ_DMACTL_R     (*((volatile uint32_t *)0x40066534))
#define GPIO_PORTQ_SI_R         (*((volatile uint32_t *)0x40066538))
#define GPIO_PORTQ_DR12R_R      (*((volatile uint32_t *)0x4006653C))
#define GPIO_PORTQ_WAKEPEN_R    (*((volatile uint32_t *)0x40066540))
#define GPIO_PORTQ_WAKELVL_R    (*((volatile uint32_t *)0x40066544))
#define GPIO_PORTQ_WAKESTAT_R   (*((volatile uint32_t *)0x40066548))
#define GPIO_PORTQ_PP_R         (*((volatile uint32_t *)0x40066FC0))
#define GPIO_PORTQ_PC_R         (*((volatile uint32_t *)0x40066FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

//*****************************************************************************
//
// GPIO registers (PORTR)
//
//*****************************************************************************
#define GPIO_PORTR_DATA_BITS_R  ((volatile uint32_t *)0x40067000)
#define GPIO_PORTR_DATA_R       (*((volatile uint32_t *)0x400673FC))
#define GPIO_PORTR_DIR_R        (*((volatile uint32_t *)0x40067400))
#define GPIO_PORTR_IS_R         (*((volatile uint32_t *)0x40067404))
#define GPIO_PORTR_IBE_R        (*((volatile uint32_t *)0x40067408))
#define GPIO_PORTR_IEV_R        (*((volatile uint32_t *)0x4006740C))
#define GPIO_PORTR_IM_R         (*((volatile uint32_t *)0x40067410))
#define GPIO_PORTR_RIS_R        (*((volatile uint32_t *)0x40067414))
#define GPIO_PORTR_MIS_R        (*((volatile uint32_t *)0x40067418))
#define GPIO_PORTR_ICR_R        (*((volatile uint32_t *)0x4006741C))
#define GPIO_PORTR_AFSEL_R      (*((volatile uint32_t *)0x40067420))
#define GPIO_PORTR_DR2R_R       (*((volatile uint32_t *)0x40067500))
#define GPIO_PORTR_DR4R_R       (*((volatile uint32_t *)0x40067504))
#define GPIO_PORTR_DR8R_R       (*((volatile uint32_t *)0x40067508))
#define GPIO_PORTR_ODR_R        (*((volatile uint32_t *)0x4006750C))
#define GPIO_PORTR_PUR_R        (*((volatile uint32_t *)0x40067510))
#define GPIO_PORTR_PDR_R        (*((volatile uint32_t *)0x40067514))
#define GPIO_PORTR_SLR_R        (*((volatile uint32_t *)0x40067518))
#define GPIO_PORTR_DEN_R        (*((volatile uint32_t *)0x4006751C))
#define GPIO_PORTR_LOCK_R       (*((volatile uint32_t *)0x40067520))
#define GPIO_PORTR_CR_R         (*((volatile uint32_t *)0x40067524))
#define GPIO_PORTR_AMSEL_R      (*((volatile uint32_t *)0x40067528))
#define GPIO_PORTR_PCTL_R       (*((volatile uint32_t *)0x4006752C))
#define GPIO_PORTR_ADCCTL_R     (*((volatile uint32_t *)0x40067530))
#define GPIO_PORTR_DMACTL_R     (*((volatile uint32_t *)0x40067534))
#define GPIO_PORTR_SI_R         (*((volatile uint32_t *)0x40067538))
#define GPIO_PORTR_DR12R_R      (*((volatile uint32_t *)0x4006753C))
#define GPIO_PORTR_WAKEPEN_R    (*((volatile uint32_t *)0x40067540))
#define GPIO_PORTR_WAKELVL_R    (*((volatile uint32_t *)0x40067544))
#define GPIO_PORTR_WAKESTAT_R   (*((volatile uint32_t *)0x40067548))
#define GPIO_PORTR_PP_R         (*((volatile uint32_t *)0x40067FC0))
#define GPIO_PORTR_PC_R         (*((volatile uint32_t *)0x40067FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

//*****************************************************************************
//
// GPIO registers (PORTS)
//
//*****************************************************************************
#define GPIO_PORTS_DATA_BITS_R  ((volatile uint32_t *)0x40068000)
#define GPIO_PORTS_DATA_R       (*((volatile uint32_t *)0x400683FC))
#define GPIO_PORTS_DIR_R        (*((volatile uint32_t *)0x40068400))
#define GPIO_PORTS_IS_R         (*((volatile uint32_t *)0x40068404))
#define GPIO_PORTS_IBE_R        (*((volatile uint32_t *)0x40068408))
#define GPIO_PORTS_IEV_R        (*((volatile uint32_t *)0x4006840C))
#define GPIO_PORTS_IM_R         (*((volatile uint32_t *)0x40068410))
#define GPIO_PORTS_RIS_R        (*((volatile uint32_t *)0x40068414))
#define GPIO_PORTS_MIS_R        (*((volatile uint32_t *)0x40068418))
#define GPIO_PORTS_ICR_R        (*((volatile uint32_t *)0x4006841C))
#define GPIO_PORTS_AFSEL_R      (*((volatile uint32_t *)0x40068420))
#define GPIO_PORTS_DR2R_R       (*((volatile uint32_t *)0x40068500))
#define GPIO_PORTS_DR4R_R       (*((volatile uint32_t *)0x40068504))
#define GPIO_PORTS_DR8R_R       (*((volatile uint32_t *)0x40068508))
#define GPIO_PORTS_ODR_R        (*((volatile uint32_t *)0x4006850C))
#define GPIO_PORTS_PUR_R        (*((volatile uint32_t *)0x40068510))
#define GPIO_PORTS_PDR_R        (*((volatile uint32_t *)0x40068514))
#define GPIO_PORTS_SLR_R        (*((volatile uint32_t *)0x40068518))
#define GPIO_PORTS_DEN_R        (*((volatile uint32_t *)0x4006851C))
#define GPIO_PORTS_LOCK_R       (*((volatile uint32_t *)0x40068520))
#define GPIO_PORTS_CR_R         (*((volatile uint32_t *)0x40068524))
#define GPIO_PORTS_AMSEL_R      (*((volatile uint32_t *)0x40068528))
#define GPIO_PORTS_PCTL_R       (*((volatile uint32_t *)0x4006852C))
#define GPIO_PORTS_ADCCTL_R     (*((volatile uint32_t *)0x40068530))
#define GPIO_PORTS_DMACTL_R     (*((volatile uint32_t *)0x40068534))
#define GPIO_PORTS_SI_R         (*((volatile uint32_t *)0x40068538))
#define GPIO_PORTS_DR12R_R      (*((volatile uint32_t *)0x4006853C))
#define GPIO_PORTS_WAKEPEN_R    (*((volatile uint32_t *)0x40068540))
#define GPIO_PORTS_WAKELVL_R    (*((volatile uint32_t *)0x40068544))
#define GPIO_PORTS_WAKESTAT_R   (*((volatile uint32_t *)0x40068548))
#define GPIO_PORTS_PP_R         (*((volatile uint32_t *)0x40068FC0))
#define GPIO_PORTS_PC_R         (*((volatile uint32_t *)0x40068FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

//*****************************************************************************
//
// GPIO registers (PORTT)
//
//*****************************************************************************
#define GPIO_PORTT_DATA_BITS_R  ((volatile uint32_t *)0x40069000)
#define GPIO_PORTT_DATA_R       (*((volatile uint32_t *)0x400693FC))
#define GPIO_PORTT_DIR_R        (*((volatile uint32_t *)0x40069400))
#define GPIO_PORTT_IS_R         (*((volatile uint32_t *)0x40069404))
#define GPIO_PORTT_IBE_R        (*((volatile uint32_t *)0x40069408))
#define GPIO_PORTT_IEV_R        (*((volatile uint32_t *)0x4006940C))
#define GPIO_PORTT_IM_R         (*((volatile uint32_t *)0x40069410))
#define GPIO_PORTT_RIS_R        (*((volatile uint32_t *)0x40069414))
#define GPIO_PORTT_MIS_R        (*((volatile uint32_t *)0x40069418))
#define GPIO_PORTT_ICR_R        (*((volatile uint32_t *)0x4006941C))
#define GPIO_PORTT_AFSEL_R      (*((volatile uint32_t *)0x40069420))
#define GPIO_PORTT_DR2R_R       (*((volatile uint32_t *)0x40069500))
#define GPIO_PORTT_DR4R_R       (*((volatile uint32_t *)0x40069504))
#define GPIO_PORTT_DR8R_R       (*((volatile uint32_t *)0x40069508))
#define GPIO_PORTT_ODR_R        (*((volatile uint32_t *)0x4006950C))
#define GPIO_PORTT_PUR_R        (*((volatile uint32_t *)0x40069510))
#define GPIO_PORTT_PDR_R        (*((volatile uint32_t *)0x40069514))
#define GPIO_PORTT_SLR_R        (*((volatile uint32_t *)0x40069518))
#define GPIO_PORTT_DEN_R        (*((volatile uint32_t *)0x4006951C))
#define GPIO_PORTT_LOCK_R       (*((volatile uint32_t *)0x40069520))
#define GPIO_PORTT_CR_R         (*((volatile uint32_t *)0x40069524))
#define GPIO_PORTT_AMSEL_R      (*((volatile uint32_t *)0x40069528))
#define GPIO_PORTT_PCTL_R       (*((volatile uint32_t *)0x4006952C))
#define GPIO_PORTT_ADCCTL_R     (*((volatile uint32_t *)0x40069530))
#define GPIO_PORTT_DMACTL_R     (*((volatile uint32_t *)0x40069534))
#define GPIO_PORTT_SI_R         (*((volatile uint32_t *)0x40069538))
#define GPIO_PORTT_DR12R_R      (*((volatile uint32_t *)0x4006953C))
#define GPIO_PORTT_WAKEPEN_R    (*((volatile uint32_t *)0x40069540))
#define GPIO_PORTT_WAKELVL_R    (*((volatile uint32_t *)0x40069544))
#define GPIO_PORTT_WAKESTAT_R   (*((volatile uint32_t *)0x40069548))
#define GPIO_PORTT_PP_R         (*((volatile uint32_t *)0x40069FC0))
#define GPIO_PORTT_PC_R         (*((volatile uint32_t *)0x40069FC4))
#define GPIO_PCTL_PR_R          (*((volatile uint32_t *)0x00012000))
#define GPIO_PCTL_PS_R          (*((volatile uint32_t *)0x00013000))
#define GPIO_PCTL_PT_R          (*((volatile uint32_t *)0x00014000))

